In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Şirket': ['TURKCELL', 'TURKCELL', 'VODAFONE', 'VODAFONE', 'TTELEKOM', 'TTELEKOM'],
       'Kişi': ['Mehmet', 'Büşra', 'Selim', 'Caner', 'Gamze', 'Merve'],
       'Satış': [250, 325, 152, 645, 468, 525]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     Kişi  Satış    Şirket
0  Mehmet    250  TURKCELL
1   Büşra    325  TURKCELL
2   Selim    152  VODAFONE
3   Caner    645  VODAFONE
4   Gamze    468  TTELEKOM
5   Merve    525  TTELEKOM

In [6]:
sirket = df.groupby('Şirket')

In [8]:
sirket.mean()

          Satış
Şirket
TTELEKOM  496.5
TURKCELL  287.5
VODAFONE  398.5

In [9]:
sirket.sum()

          Satış
Şirket
TTELEKOM    993
TURKCELL    575
VODAFONE    797

In [10]:
sirket.std()

               Satış
Şirket
TTELEKOM   40.305087
TURKCELL   53.033009
VODAFONE  348.603643

In [11]:
sirket.sum().loc['TURKCELL']

Satış    575
Name: TURKCELL, dtype: int64

In [14]:
df.groupby('Şirket').max()

            Kişi  Satış
Şirket
TTELEKOM   Merve    525
TURKCELL  Mehmet    325
VODAFONE   Selim    645

In [15]:
df.groupby('Şirket').describe()

         Satış
         count   mean         std    min     25%    50%     75%    max
Şirket
TTELEKOM   2.0  496.5   40.305087  468.0  482.25  496.5  510.75  525.0
TURKCELL   2.0  287.5   53.033009  250.0  268.75  287.5  306.25  325.0
VODAFONE   2.0  398.5  348.603643  152.0  275.25  398.5  521.75  645.0